openfoam/2_drivencavity_heat/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              0.002;
// Re = d|U|/nu
// want: d = 2.0, |U| = 1.0, Re = 1000 => nu = 0.002

// Thermal expansion coefficient
beta            1e-03;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              1.0;

// Turbulent Prandtl number
Prt             1.0;

// ************************************************************************* //
