openfoam/2_drivencavity_heat/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform 300;
    }

    movingWall
    {
        type            fixedValue;
        value           uniform 304;
    }

    fixedWalls
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
