openfoam/2_drivencavity_heat/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //

