openfoam/2_drivencavity_heat/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // p
    // {
    //     solver          PCG;
    //     preconditioner  DIC;
    //     tolerance       1e-06;
    //     relTol          0.05;
    // }

    // pFinal
    // {
    //     $p;
    //     relTol          0;
    // }
    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    // U
    // {
    //     solver          smoothSolver;
    //     smoother        symGaussSeidel;
    //     tolerance       1e-05;
    //     relTol          0;
    // }

    "(U|T)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|T)Final"
    {
        $T;
        relTol          0;
    }

}

// PISO
// {
//     nCorrectors     2;
//     nNonOrthogonalCorrectors 0;
//     pRefCell        0;
//     pRefValue       0;
// }

PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors       2;
    pRefCell          0;
    pRefValue         0;
}



// ************************************************************************* //
